from flask import Flask, render_template, url_for, request
from flask_sqlalchemy import SQLAlchemy

app = Flask(__name__)
app.config['SQLALCHEMY_DATABASE_URI'] = 'sqlite:///database/vark_db.db'
db = SQLAlchemy(app)

class Subject(db.Model):
    id = db.Column(db.Integer, primary_key=True)
    name = db.Column(db.String(20), unique=True, nullable=False)
    chapters = db.relationship('Chapter', backref='subject', lazy=True)
    def __repr__(self):
        return f"Subject('{self.name}')"

class Chapter(db.Model):
    id = db.Column(db.Integer, primary_key=True)
    name = db.Column(db.String(20), nullable=False)
    number = db.Column(db.Integer, nullable=False)
    subject_id = db.Column(db.Integer, db.ForeignKey('subject.id'), nullable=False)

    topics = db.relationship('Topic', backref='chapter', lazy=True)

    def __repr__(self):
        return f"Chapter('{self.name}', '{self.number}')"

class Topic(db.Model):
    id = db.Column(db.Integer, primary_key=True)
    name = db.Column(db.String(20), nullable=False)
    number = db.Column(db.String, nullable=False)
    chapter_id = db.Column(db.Integer, db.ForeignKey('chapter.id'), nullable=False)
    contents = db.relationship('Content', backref='topic', lazy=True)

    def __repr__(self):
        return f"Topic('{self.name}', '{self.number}')"

class Content(db.Model):
    id = db.Column(db.Integer, primary_key=True)
    file_name = db.Column(db.String(250), nullable=False)
    c_type = db.Column(db.String(10), nullable=False)
    topic_id = db.Column(db.Integer, db.ForeignKey('topic.id'), nullable=False)
   
    def __repr__(self):
        return f"Content('{self.file_name}','{self.c_type}')"

def create_subject():
    db.create_all()
    subject = Subject(name="การสร้างสื่อดิจิทัล")
    db.session.add(subject)
    db.session.commit()

def create_chapter():
    db.create_all()
    chap = {
        1:'รู้จักกับการตัดต่อภาพยนตร์',
        2:'ขั้นตอนการทำงานในงานตัดต่อวิดีโอ',
        3:'การทำงานกับโปรเจ็กต์',
        4:'จัดการซีเควนซืและการใช้งานคลิป',
        5:'การตัดต่อบน Timeline',
        6:'การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว',
        7:'การใส่เสียงและการเผยแพร่ผลงาน'
    }

    subject = Subject.query.filter_by(name='การสร้างสื่อดิจิทัล').first()

    for c in chap:
        db.session.add(Chapter(name=chap[c], number=c, subject_id=subject.id))
    
    db.session.commit()
    print(subject.chapters)

def create_topic():
    db.create_all()
    chapter = Chapter.query.all()
    topic = [
        {
            'P_1':'แบบทดสอบก่อนเรียน',
            '1.1':'ประเภทและขั้นตอนของการตัดต่อภาพยนตร์',
            '1.2':'ขั้นตอนการสร้างภาพยนตร์',
            '1.3':'ทำความรู้จักกับ Adobe Premiere Pro',
            '1.4':'การเข้าสู่โปรแกรมและการจัดรูปแบบหน้าต่างการทำงานของ Adobe Premiere Pro',
            'T_1':'แบบทดสอบหลังเรียน'

        },
        {
            'P_2':'แบบทดสอบก่อนเรียน',
            '2.1':'การสร้าง Workflow การตัดต่อสำหรับ Post-Production',
            '2.2':'ขั้นตอนการตัดต่อและการสร้าง Storyboard ในงานตัดต่อวิดีโอ',
            'T_2':'แบบทดสอบหลังเรียน'
        },
        {
            'P_3':'แบบทดสอบก่อนเรียน',
            '3.1':'การตั้งค่าโปรเจ็กต์',
            '3.2':'การบันทึกโปรเจ็กต์',
            '3.3':'ข้อมูลไฟล์ฟุตเทจที่นำมาใช้งานตัดต่อ',
            '3.4':'การ Import ฟุตเทจเข้ามาทำงาน',
            'T_3':'แบบทดสอบหลังเรียน'
        },
        {
            'P_4':'แบบทดสอบก่อนเรียน',
            '4.1':'ระบบสัญญาณภาพวิดีโอ',
            '4.2':'การตั้งค่าซีเควนซ์',
            '4.3':'การใช้งานคลิป',
            '4.4':'การจัดการคลิปบนพาเนล Timeline',
            '4.5':'วิธีสร้างคลิปพิเศษ',
            'T_4':'แบบทดสอบหลังเรียน'
        },
        {
            'P_5':'แบบทดสอบก่อนเรียน',
            '5.1':'การ Trim คลิปวิดีโอ',
            '5.2':'การตัดต่อคลิปวิดีโอบนพาเนล Timeline',
            '5.3':'การทำงานกับคีย์เฟรมบนคลิป',
            '5.4':'การสร้างฉากสโลวโมชั่นและเร่งสปีดคลิปด้วย Time Remapping',
            'T_5':'แบบทดสอบหลังเรียน'
        },
        {
            'P_6':'แบบทดสอบก่อนเรียน',
            '6.1':'การจัดการทรานซิชัน',
            '6.2':'การใส่เอฟเฟกต์ให้คลิปวิดีโอ',
            '6.3':'การสร้างไตเติล',
            '6.4':'การสร้างการเคลื่อนไหวของคลิปวิดีโอ',
            'T_6':'แบบทดสอบหลังเรียน'
        },
        {
            'P_7':'แบบทดสอบก่อนเรียน',
            '7.1':'ตัดต่อทำงานกับเสียง',
            '7.2':'การ Export เพื่อเผยแพร่ไฟล์วิดีโอ',
            'T_7':'แบบทดสอบหลังเรียน'
        }
    ]

    index = 0
    for c in chapter:
        for t in topic[index]:
            db.session.add(Topic(name=topic[index][t], number=t, chapter_id=c.id))
        index += 1
    print(Topic.query.all())
    db.session.commit()

def create_content():
    db.create_all()
    topic = Topic.query.all()
    content = [
        {
            'P':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/A_แบบทดสอบก่อนเรียน/PreCh1.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/B_1.1 ประเภทและขั้นตอนของการตัดต่อภาพยนตร์/V_1.1.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/B_1.1 ประเภทและขั้นตอนของการตัดต่อภาพยนตร์/A_1.1.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/B_1.1 ประเภทและขั้นตอนของการตัดต่อภาพยนตร์/R_1.1.pdf',
            'K':[  
                'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/B_1.1 ประเภทและขั้นตอนของการตัดต่อภาพยนตร์/K_1.1.1.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/B_1.1 ประเภทและขั้นตอนของการตัดต่อภาพยนตร์/K_1.1.2.swf'
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/B_1.1 ประเภทและขั้นตอนของการตัดต่อภาพยนตร์/Exercise 1.1/Exer1.1.pdf'     
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/C_1.2 ขั้นตอนการสร้างภาพยนตร์/V_1.2.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/C_1.2 ขั้นตอนการสร้างภาพยนตร์/A_1.2.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/C_1.2 ขั้นตอนการสร้างภาพยนตร์/R_1.2.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/C_1.2 ขั้นตอนการสร้างภาพยนตร์/K_1.2.swf'
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/C_1.2 ขั้นตอนการสร้างภาพยนตร์/Exercise 1.2/Exer1.2.pdf',
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/D_1.3 ทำความรู้จักกับ Adobe Premiere Pro/V_1.3.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/D_1.3 ทำความรู้จักกับ Adobe Premiere Pro/A_1.3.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/D_1.3 ทำความรู้จักกับ Adobe Premiere Pro/R_1.3.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/D_1.3 ทำความรู้จักกับ Adobe Premiere Pro/K_1.3.1.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/D_1.3 ทำความรู้จักกับ Adobe Premiere Pro/K_1.3.2.swf'
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/D_1.3 ทำความรู้จักกับ Adobe Premiere Pro/Exercise 1.3/Exer1.3.pdf',
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/E_1.4 การเข้าสู่โปรแกรมและการจัดรูปแบบหน้าต่างการทำงานของ Adobe Premiere Pro/V_1.4.pdf.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/E_1.4 การเข้าสู่โปรแกรมและการจัดรูปแบบหน้าต่างการทำงานของ Adobe Premiere Pro/A_1.4.pdf.pdf',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/E_1.4 การเข้าสู่โปรแกรมและการจัดรูปแบบหน้าต่างการทำงานของ Adobe Premiere Pro/R_1.4.pdf.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/E_1.4 การเข้าสู่โปรแกรมและการจัดรูปแบบหน้าต่างการทำงานของ Adobe Premiere Pro/K_1.4.1.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/E_1.4 การเข้าสู่โปรแกรมและการจัดรูปแบบหน้าต่างการทำงานของ Adobe Premiere Pro/K_1.4.2.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/E_1.4 การเข้าสู่โปรแกรมและการจัดรูปแบบหน้าต่างการทำงานของ Adobe Premiere Pro/K_1.4.3.swf'
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/E_1.4 การเข้าสู่โปรแกรมและการจัดรูปแบบหน้าต่างการทำงานของ Adobe Premiere Pro/Exercise 1.4/Exer1.4.pdf',

        },
        {
            'T':'static/การสร้างสื่อดิจิทัล/บทที่ 1  รู้จักกับการตัดต่อภาพยนตร์/I_แบบทดสอบหลังเรียน/PostCh1.pdf.pdf'
        },
        {
            'P':'static/การสร้างสื่อดิจิทัล/บทที่ 2  ขั้นตอนการทำงานในงานตัดต่อวิดีโอ/A_แบบทดสอบก่อนเรียน/PreCh2.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 2  ขั้นตอนการทำงานในงานตัดต่อวิดีโอ/B_2.1 การสร้าง Workflow การตัดต่อสำหรับ Post-Production/V_2.1.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 2  ขั้นตอนการทำงานในงานตัดต่อวิดีโอ/B_2.1 การสร้าง Workflow การตัดต่อสำหรับ Post-Production/A_2.1.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 2  ขั้นตอนการทำงานในงานตัดต่อวิดีโอ/B_2.1 การสร้าง Workflow การตัดต่อสำหรับ Post-Production/R_2.1.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 2  ขั้นตอนการทำงานในงานตัดต่อวิดีโอ/B_2.1 การสร้าง Workflow การตัดต่อสำหรับ Post-Production/K_2.1.swf'
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 2  ขั้นตอนการทำงานในงานตัดต่อวิดีโอ/B_2.1 การสร้าง Workflow การตัดต่อสำหรับ Post-Production/Exercise 2.1/Exer2.1.pdf',

        },

        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 2  ขั้นตอนการทำงานในงานตัดต่อวิดีโอ/C_2.2 ขั้นตอนการตัดต่อและการสร้าง Storyboard ในงานตัดต่อวิดีโอ/V_2.2.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 2  ขั้นตอนการทำงานในงานตัดต่อวิดีโอ/C_2.2 ขั้นตอนการตัดต่อและการสร้าง Storyboard ในงานตัดต่อวิดีโอ/A_2.2.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 2  ขั้นตอนการทำงานในงานตัดต่อวิดีโอ/C_2.2 ขั้นตอนการตัดต่อและการสร้าง Storyboard ในงานตัดต่อวิดีโอ/R_2.2.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 2  ขั้นตอนการทำงานในงานตัดต่อวิดีโอ/C_2.2 ขั้นตอนการตัดต่อและการสร้าง Storyboard ในงานตัดต่อวิดีโอ/K_2.2.swf'
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 2  ขั้นตอนการทำงานในงานตัดต่อวิดีโอ/C_2.2 ขั้นตอนการตัดต่อและการสร้าง Storyboard ในงานตัดต่อวิดีโอ/Exercise 2.2/Exer2.2.pdf',

        },
        {
            'T':'static/การสร้างสื่อดิจิทัล/บทที่ 2  ขั้นตอนการทำงานในงานตัดต่อวิดีโอ/D_แบบทดสอบหลังเรียน/PostCh2.pdf.pdf'
        },
        {
            'P':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/A_แบบทดสอบก่อนเรียน/PreCh3.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/B_3.1 การตั้งค่าโปรเจ็กต์/V_3.1.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/B_3.1 การตั้งค่าโปรเจ็กต์/A_3.1.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/B_3.1 การตั้งค่าโปรเจ็กต์/R_3.1.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/B_3.1 การตั้งค่าโปรเจ็กต์/K_3.1.swf'
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/CB_3.1 การตั้งค่าโปรเจ็กต์/Exercise 3.1/Exer3.1.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/C_3.2 การบันทึกโปรเจ็กต์/V_3.2.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/C_3.2 การบันทึกโปรเจ็กต์/A_3.2.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/C_3.2 การบันทึกโปรเจ็กต์/R_3.2.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/C_3.2 การบันทึกโปรเจ็กต์/K_3.2.swf'
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/C_3.2 การบันทึกโปรเจ็กต์/Exercise 3.2/Exer3.2.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/D_3.3 ข้อมูลไฟล์ฟุตเทจที่นำมาใช้งานตัดต่อ/V_3.3.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/D_3.3 ข้อมูลไฟล์ฟุตเทจที่นำมาใช้งานตัดต่อ/A_3.3.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/D_3.3 ข้อมูลไฟล์ฟุตเทจที่นำมาใช้งานตัดต่อ/R_3.3.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/D_3.3 ข้อมูลไฟล์ฟุตเทจที่นำมาใช้งานตัดต่อ/K_3.3.swf'
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/D_3.3 ข้อมูลไฟล์ฟุตเทจที่นำมาใช้งานตัดต่อ/Exercise 3.3/Exer3.3.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/E_3.4 การ Import ฟุตเทจเข้ามาทำงาน/V_3.4.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/E_3.4 การ Import ฟุตเทจเข้ามาทำงาน/A_3.4.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/E_3.4 การ Import ฟุตเทจเข้ามาทำงาน/R_3.4.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/E_3.4 การ Import ฟุตเทจเข้ามาทำงาน/K_3.4.1.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/E_3.4 การ Import ฟุตเทจเข้ามาทำงาน/K_3.4.2.swf'
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/E_3.4 การ Import ฟุตเทจเข้ามาทำงาน/Exercise 3.4/Exer3.4.pdf'
        },
        {
            'T':'static/การสร้างสื่อดิจิทัล/บทที่ 3  การทำงานกับโปรเจ็กต์/G_แบบทดสอบหลังเรียน/PostCh3.pdf'
        },
        {
            'P':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/A_ แบบทดสอบก่อนเรียน/PreCh4.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/B_4.1 ระบบสัญญาณภาพวิดีโอ/V_4.1.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/B_4.1 ระบบสัญญาณภาพวิดีโอ/A_4.1.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/B_4.1 ระบบสัญญาณภาพวิดีโอ/R_4.1.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/B_4.1 ระบบสัญญาณภาพวิดีโอ/K_4.1.swf'
              
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/B_4.1 ระบบสัญญาณภาพวิดีโอ/Exercise 4.1/Exer4.1.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/C_4.2 การตั้งค่าซีเควนซ์/V_4.2.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/C_4.2 การตั้งค่าซีเควนซ์/A_4.2.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/C_4.2 การตั้งค่าซีเควนซ์/R_4.2.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/C_4.2 การตั้งค่าซีเควนซ์/K_4.2.swf'
              
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/C_4.2 การตั้งค่าซีเควนซ์/Exercise 4.2/Exer4.2.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/D_4.3 การใช้งานคลิป/V_4.3.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/D_4.3 การใช้งานคลิป/A_4.3.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/D_4.3 การใช้งานคลิป/R_4.3.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/D_4.3 การใช้งานคลิป/K_4.3.1.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/D_4.3 การใช้งานคลิป/K_4.3.2.swf'
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/D_4.3 การใช้งานคลิป/Exercise 4.3/Exer4.3.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/F_4.4 การจัดการคลิปบนพาเนล Timeline/V_4.4.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/F_4.4 การจัดการคลิปบนพาเนล Timeline/A_4.4.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/F_4.4 การจัดการคลิปบนพาเนล Timeline/R_4.4.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/F_4.4 การจัดการคลิปบนพาเนล Timeline/K_4.4.swf'
              
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/F_4.4 การจัดการคลิปบนพาเนล Timeline/Exercise 4.4/Exer4.4.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/G_4.5 วิธีสร้างคลิปพิเศษ/V_4.5.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/G_4.5 วิธีสร้างคลิปพิเศษ/A_4.5.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/G_4.5 วิธีสร้างคลิปพิเศษ/R_4.5.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/G_4.5 วิธีสร้างคลิปพิเศษ/K_4.5.1.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/G_4.5 วิธีสร้างคลิปพิเศษ/K_4.5.2.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/G_4.5 วิธีสร้างคลิปพิเศษ/K_4.5.3.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/G_4.5 วิธีสร้างคลิปพิเศษ/K_4.5.4.swf'
              
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/G_4.5 วิธีสร้างคลิปพิเศษ/Exercise 4.5/Exer4.5.pdf'
        },
        {
            'T':'static/การสร้างสื่อดิจิทัล/บทที่ 4  จัดการซีเควนซืและการใช้งานคลิป/K_แบบทดสอบหลังเรียน/PostCh4.pdf'
        },
        {
            'P':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/A_ แบบทดสอบก่อนเรียน/PreCh5.pdf'
        },{
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/B_5.1 การ Trim คลิปวิดีโอ/V_5.1.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/B_5.1 การ Trim คลิปวิดีโอ/A_5.1.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/B_5.1 การ Trim คลิปวิดีโอ/R_5.1.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/B_5.1 การ Trim คลิปวิดีโอ/K_5.1.1.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/B_5.1 การ Trim คลิปวิดีโอ/K_5.1.2.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/B_5.1 การ Trim คลิปวิดีโอ/K_5.1.3.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/B_5.1 การ Trim คลิปวิดีโอ/K_5.1.4.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/B_5.1 การ Trim คลิปวิดีโอ/K_5.1.5.swf'
                         
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/B_5.1 การ Trim คลิปวิดีโอ/Exercise 5.1/Exer5.1.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/C_5.2 การตัดต่อคลิปวิดีโอบนพาเนล Timeline/V_5.2.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/C_5.2 การตัดต่อคลิปวิดีโอบนพาเนล Timeline/A_5.2.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/C_5.2 การตัดต่อคลิปวิดีโอบนพาเนล Timeline/R_5.2.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/C_5.2 การตัดต่อคลิปวิดีโอบนพาเนล Timeline/K_5.2.1.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/C_5.2 การตัดต่อคลิปวิดีโอบนพาเนล Timeline/K_5.2.2.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/C_5.2 การตัดต่อคลิปวิดีโอบนพาเนล Timeline/K_5.2.3.swf'
                         
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/C_5.2 การตัดต่อคลิปวิดีโอบนพาเนล Timeline/Exercise 5.2/Exer5.2.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/D_5.3 การทำงานกับคีย์เฟรมบนคลิป/V_5.3.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/D_5.3 การทำงานกับคีย์เฟรมบนคลิป/A_5.3.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/D_5.3 การทำงานกับคีย์เฟรมบนคลิป/R_5.3.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/D_5.3 การทำงานกับคีย์เฟรมบนคลิป/K_5.3.1.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/D_5.3 การทำงานกับคีย์เฟรมบนคลิป/K_5.3.2.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/D_5.3 การทำงานกับคีย์เฟรมบนคลิป/K_5.3.3.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/D_5.3 การทำงานกับคีย์เฟรมบนคลิป/K_5.3.4.swf'                    
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/D_5.3 การทำงานกับคีย์เฟรมบนคลิป/Exercise 5.3/Exer5.3.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/E_5.4 การสร้างฉากสโลวโมชั่นและเร่งสปีดคลิปด้วย Time Remapping/V_5.4.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/E_5.4 การสร้างฉากสโลวโมชั่นและเร่งสปีดคลิปด้วย Time Remapping/A_5.4.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/E_5.4 การสร้างฉากสโลวโมชั่นและเร่งสปีดคลิปด้วย Time Remapping/R_5.4.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/E_5.4 การสร้างฉากสโลวโมชั่นและเร่งสปีดคลิปด้วย Time Remapping/K_5.4.swf'
                         
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/E_5.4 การสร้างฉากสโลวโมชั่นและเร่งสปีดคลิปด้วย Time Remapping/Exercise 5.4/Exer5.4.pdf'
        },
        {
            'T':'static/การสร้างสื่อดิจิทัล/บทที่ 5  การตัดต่อบน Timeline/F_แบบทดสอบหลังเรียน/PostCh5.pdf'
        },
        {
            'P':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/A_ แบบทดสอบก่อนเรียน/PreCh6.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/B_6.1 การจัดการทรานซิชัน/V_6.1.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/B_6.1 การจัดการทรานซิชัน/A_6.1.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/B_6.1 การจัดการทรานซิชัน/R_6.1.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/B_6.1 การจัดการทรานซิชัน/K_6.1.1.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/B_6.1 การจัดการทรานซิชัน/K_6.1.2.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/B_6.1 การจัดการทรานซิชัน/K_6.1.3.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/B_6.1 การจัดการทรานซิชัน/K_6.1.4.swf'
                         
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/B_6.1 การจัดการทรานซิชัน/Exercise 6.1/Exer6.1.pdf'
        },
         {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/C_6.2 การใส่เอฟเฟกต์ให้คลิปวิดีโอ/V_6.2.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/C_6.2 การใส่เอฟเฟกต์ให้คลิปวิดีโอ/A_6.2.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/C_6.2 การใส่เอฟเฟกต์ให้คลิปวิดีโอ/R_6.2.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/C_6.2 การใส่เอฟเฟกต์ให้คลิปวิดีโอ/K_6.2.1.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/C_6.2 การใส่เอฟเฟกต์ให้คลิปวิดีโอ/K_6.2.2.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/C_6.2 การใส่เอฟเฟกต์ให้คลิปวิดีโอ/K_6.2.3.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/C_6.2 การใส่เอฟเฟกต์ให้คลิปวิดีโอ/K_6.2.4.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/C_6.2 การใส่เอฟเฟกต์ให้คลิปวิดีโอ/K_6.2.5.swf'
                         
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/C_6.2 การใส่เอฟเฟกต์ให้คลิปวิดีโอ/Exercise 6.2/Exer6.2.pdf'
        },
         {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/D_6.3 การสร้างไตเติล/V_6.3.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/D_6.3 การสร้างไตเติล/A_6.3.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/D_6.3 การสร้างไตเติล/R_6.3.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/D_6.3 การสร้างไตเติล/K_6.3.1.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/D_6.3 การสร้างไตเติล/K_6.3.2.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/D_6.3 การสร้างไตเติล/K_6.3.3.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/D_6.3 การสร้างไตเติล/K_6.3.4.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/D_6.3 การสร้างไตเติล/K_6.3.5.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/D_6.3 การสร้างไตเติล/K_6.3.6.swf'
                         
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/D_6.3 การสร้างไตเติล/Exercise 6.3/Exer6.3.pdf'
        },
         {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/E_6.4 การสร้างการเคลื่อนไหวของคลิปวิดีโอ/V_6.4.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/E_6.4 การสร้างการเคลื่อนไหวของคลิปวิดีโอ/A_6.4.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/E_6.4 การสร้างการเคลื่อนไหวของคลิปวิดีโอ/R_6.4.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/E_6.4 การสร้างการเคลื่อนไหวของคลิปวิดีโอ/K_6.4.1.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/E_6.4 การสร้างการเคลื่อนไหวของคลิปวิดีโอ/K_6.4.2.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/E_6.4 การสร้างการเคลื่อนไหวของคลิปวิดีโอ/K_6.4.3.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/E_6.4 การสร้างการเคลื่อนไหวของคลิปวิดีโอ/K_6.4.4.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/E_6.4 การสร้างการเคลื่อนไหวของคลิปวิดีโอ/K_6.4.5.swf'
                         
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/E_6.4 การสร้างการเคลื่อนไหวของคลิปวิดีโอ/Exercise 6.4/Exer6.4.pdf'
        },
        {
            'T':'static/การสร้างสื่อดิจิทัล/บทที่ 6 การสร้างทรานซิชัน เอฟเฟกต์และภาพเคลื่อนไหว/F_แบบทดสอบหลังเรียน/PostCh6.pdf'
        },
        {
            'P':'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/A_ แบบทดสอบก่อนเรียน/PreCh7.pdf'
        },
         {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/B_7.1 ตัดต่อทำงานกับเสียง/V_7.1.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/B_7.1 ตัดต่อทำงานกับเสียง/A_7.1.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/B_7.1 ตัดต่อทำงานกับเสียง/R_7.1.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/B_7.1 ตัดต่อทำงานกับเสียง/K_7.1.1.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/B_7.1 ตัดต่อทำงานกับเสียง/K_7.1.2.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/B_7.1 ตัดต่อทำงานกับเสียง/K_7.1.3.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/B_7.1 ตัดต่อทำงานกับเสียง/K_7.1.4.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/B_7.1 ตัดต่อทำงานกับเสียง/K_7.1.5.swf'
                         
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/B_7.1 ตัดต่อทำงานกับเสียง/Exercise 7.1/Exer7.1.pdf'
        },
        {
            'V':'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/C_7.2 การ Export เพื่อเผยแพร่ไฟล์วิดีโอ/V_7.2.pdf',
            'A':'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/C_7.2 การ Export เพื่อเผยแพร่ไฟล์วิดีโอ/A_7.2.mp3',
            'R':'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/C_7.2 การ Export เพื่อเผยแพร่ไฟล์วิดีโอ/R_7.2.pdf',
            'K':[
                'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/C_7.2 การ Export เพื่อเผยแพร่ไฟล์วิดีโอ/K_7.2.1.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/C_7.2 การ Export เพื่อเผยแพร่ไฟล์วิดีโอ/K_7.2.2.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/C_7.2 การ Export เพื่อเผยแพร่ไฟล์วิดีโอ/K_7.2.3.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/C_7.2 การ Export เพื่อเผยแพร่ไฟล์วิดีโอ/K_7.2.4.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/C_7.2 การ Export เพื่อเผยแพร่ไฟล์วิดีโอ/K_7.2.5.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/C_7.2 การ Export เพื่อเผยแพร่ไฟล์วิดีโอ/K_7.2.6.swf',
                'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/C_7.2 การ Export เพื่อเผยแพร่ไฟล์วิดีโอ/K_7.2.7.swf'
                         
            ],
            'E':'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/C_7.2 การ Export เพื่อเผยแพร่ไฟล์วิดีโอ/Exercise 7.2/Exer7.2.pdf'
        },
        {
            'T':'static/การสร้างสื่อดิจิทัล/บทที่ 7 การใส่เสียงและการเผยแพร่ผลงาน/D_แบบทดสอบหลังเรียน/PostCh7.pdf'
        }

    ]
 
    index = 0
    for t in topic:
        for c in content[index]:
            if c == 'K':
                for part in content[index][c]:
                    db.session.add(Content(file_name=part, c_type=c, topic_id=t.id))
            else:
                
                db.session.add(Content(file_name=content[index][c], c_type=c, topic_id=t.id))
        index += 1

    print(Content.query.all())
    db.session.commit()

def get_content():
    db.create_all()
    subject = Subject.query.first()
    chapter = Chapter.query.all()
    topic = Topic.query.all()
    chapters = dict()
    topics = []
    contents = []
    for c in chapter:
        chapters[c.number] = c.name
        dict_top = dict()
        for t in c.topics:
            dict_top[t.number] = t.name
            dict_cont = dict()
            k = 1
            for ct in t.contents:
                if ct.c_type == 'K':
                    dict_cont[ct.c_type+str(k)] = ct.file_name
                    k += 1
                else:
                    dict_cont[ct.c_type] = ct.file_name
            contents.append(dict_cont)
                  
        topics.append(dict_top)

    return chapters, topics, contents

def create_varkdb():
    create_subject()
    create_chapter()
    create_topic()
    create_content()
#create_varkdb()